In [1]:
import pandas as pd

In [5]:
data = pd.read_csv("ResaleflatpricesbasedonregistrationdatefromJan2017onwards.csv")
data.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170670 entries, 0 to 170669
Data columns (total 11 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                170670 non-null  object
 1   town                 170670 non-null  object
 2   flat_type            170670 non-null  object
 3   block                170670 non-null  object
 4   street_name          170670 non-null  object
 5   storey_range         170670 non-null  object
 6   floor_area_sqm       170670 non-null  float64
 7   flat_model           170670 non-null  object
 8   lease_commence_date  170670 non-null  int64
 9   remaining_lease      170670 non-null  object
 10  resale_price         170670 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 14.3+ MB

## Data Manipulations

In [7]:
# Thw month column is in the object format, so changing that to dataetime
data['month'] = pd.to_datetime(data['month'])

In [9]:
# As we can not process datetime, leta split it into month and year of resale.
data['year'] = data['month'].dt.year
data['month'] = data['month'].dt.month

In [38]:
# lets convert the storey range to 2 values from, to
data[['storey_from','storey_to']] = data['storey_range'].str.split('TO', expand=True)
data = data.drop('storey_range', axis=1)

In [47]:
# from remaining_lease , extract the years
data['remaining_lease'] = data['remaining_lease'].str.extract("(\d+)")
data['remaining_lease'] = pd.to_numeric(data['remaining_lease'], errors='coerce')

In [55]:
data['storey_from'] = pd.to_numeric(data['storey_from'])
data['storey_to'] = pd.to_numeric(data['storey_to'])

In [48]:
data.head(3)

,month,town,flat_type,block,street_name,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,year,storey_from,storey_to
0,1,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,44.0,Improved,1979,61,232000.0,2017,10,12
1,1,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,67.0,New Generation,1978,60,250000.0,2017,01,03
2,1,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,67.0,New Generation,1980,62,262000.0,2017,01,03

In [51]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170670 entries, 0 to 170669
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   month                170670 non-null  int64
 1   town                 170670 non-null  object
 2   flat_type            170670 non-null  object
 3   block                170670 non-null  object
 4   street_name          170670 non-null  object
 5   floor_area_sqm       170670 non-null  float64
 6   flat_model           170670 non-null  object
 7   lease_commence_date  170670 non-null  int64
 8   remaining_lease      170670 non-null  int64
 9   resale_price         170670 non-null  float64
 10  year                 170670 non-null  int64
 11  storey_from          170670 non-null  int64
 12  storey_to            170670 non-null  int64
dtypes: float64(2), int64(6), object(5)
memory usage: 16.9+ MB

In [54]:
data['block'].unique()

array(['406', '108', '602', ..., '605C', '460A', '606A'], dtype=object)

## Encoding

In [ ]:
data['flat_type'] = data['flat_type'].map({ "1 ROOM " : 0, "2 ROOM" : 1, "3 ROOM" : 2, "4 ROOM" : 3, "5 ROOM" : 4, "EXECUTIVE" : 5, "MULTI-GENERATION" :6 })